Repository: proalaayahia/EShop_POC_DEMO
Catalog: projects/user/public/locale/messages.*.xlf
Languages: ar

source: password must contains at least one small letter.
ar: كلمة المرور يجب أن تحتوي على حرف صغير واحد على الأقل.

source: password must contains at least one capital letter.
ar: كلمة المرور يجب أن تحتوي على حرف كبير واحد على الأقل.

source: password must contains a number at least .
ar: كلمة المرور يجب أن تحتوي على رقم واحد على الأقل.

source: Home
ar: الرئيسية

source: Services
ar: الخدمات

source: Products
ar: المنتجات

source: Contact
ar: اتصل بنا

source: Settings
ar: الإعدادات

source: The Content You Are Looking For Not Found <a class="lead link-primary text-decoration-none" [style.cursor]="'pointer'" (click)="goHome()">Go Home</a>
ar: المحتوى الذي تبحث عنه غير موجود<a class="lead link-primary text-decoration-none" [style.cursor]="'pointer'" (click)="goHome()">اذهب إلى الصفحة الرئيسية</a>

source: You Have <span class="text-danger">{{cart.length}}</span> Items In Your Cart
ar: لديك <span class="text-danger">{{cart.length}}</span> عناصر في عربة التسوق

source: Clear Shopping Cart<mat-icon color="warn">remove_shopping_cart</mat-icon>
ar: مسح عربة التسوق<mat-icon color="warn">remove_shopping_cart</mat-icon>

source: Shopping Cart
ar: عربة التسوق

source: Photo
ar: صورة

source: Title
ar: الإسم

source: Price
ar: السعر

source: Quantity
ar: الكمية

source: Total
ar: الإجمالي

source: Options
ar: اختيارات

source: Change Quantity
ar: تغيير الكمية

source: Choose Quantity
ar: إختر الكمية

source: Delete Cart Line!
ar: حذف من العربة!

source: Total Cost:<span class="text-primary">${{total}}</span>
ar: إجمالي السعر:<span class="text-primary">${{total}}</span>

source: Continue Shopping <mat-icon>shope</mat-icon>
ar: استمر في التسوق <mat-icon>shope</mat-icon>

source: Order Now <mat-icon>shopping_basket</mat-icon>
ar: اطلب الأن <mat-icon>shopping_basket</mat-icon>

source: your product quantity must be at least one item!
ar: يجب أن تكون كمية المنتج الخاصة بك على الأقل عنصر واحد!

source: Your order sent successfully.
ar: تم إرسال طلبك بنجاح.

source: SUCCESS
ar: تمت بنجاح

source: pro
ar: صورة

source: <strong>Price: </strong>${{product.price}}
ar: <strong>السعر: </strong>${{product.price}}

source: <strong>Rate: </strong>{{product.rating.rate}}
ar: <strong>تقييم: </strong>{{product.rating.rate}}

source: <strong>Count: </strong>{{product.rating.count}}
ar: <strong>رقم: </strong>{{product.rating.count}}

source: Voice recognition
ar: البحث الصوتي

source: Start
ar: إبدأ

source: Stop
ar: توقف

source: ERROR
ar: حدث خطأ

source: Item Added To Cart Successfully.
ar: تمت إضافة العنصر إلى العربة بنجاح.

source: CHOOSE ONE CATEGORY
ar: إختر فئة واحدة

source: ALL PRODUCTS
ar: كل المنتجات

source: SHOPOY
ar: شوبْوي

source: Search
ar: بحث

source: Your Cart
ar: عربتك

source: notifications
ar: الإشعارات

source: Register
ar: تسجيل الدخول

source: LogIn
ar: دخول

source: LogOut
ar: تسجيل الخروج

source: Search
ar: بحث

source: Search. . .
ar: بحث. . .

source: Restore Your Password
ar: إستعادة كلمة المرور

source: Email
ar: البريد الإلكتروني

source: Enter your email
ar: أدخل بريدك الإلكتروني

source: Restore Now
ar: إستعادة الأن

source: Email is required
ar: البريد الإلكتروني مطلوب

source: Email is already exist
ar: البريد الإلكتروني موجود بالفعل

source: email must match email pattern!
ar: البريد الإلكتروني يجب أن يتطابق مع نمط البريد الإلكتروني!

source: Incorrect email pattern
ar: نمط البريد الإلكتروني غير صحيح

source: User Name
ar: إسم المستخدم

source: Enter your name
ar: أدخل الإسم

source: Enter Your Password
ar: أدخل كلمة المرور

source: Remember Me
ar: تذكرني

source: Submit
ar: إرسال

source: <i class="bi bi-facebook me-3"></i>Facebook
ar: <i class="bi bi-facebook me-3"></i>فيسبوك

source: <i class="bi bi-google me-3"></i>Google
ar: <i class="bi bi-google me-3"></i>جوجل

source: Forget Password?
ar: هل نسيت كلمة المرور؟

source: Don't Have Account?<a routerLink="/register" class="link-primary">SignUp Now</a>
ar: ليس لديك حساب؟ <a routerLink="/register" class="link-primary">تسجيل الدخول</a>

source: username is required
ar: اسم المستخدم مطلوب

source: username already exist
ar: اسم المستخدم موجود بالفعل

source: password is required
ar: كلمة المرور مطلوبة

source: Confirm Your Password
ar: تأكيد كلمة المرور

source: password minimum length is 6 characters
ar: الحد الأدنى لطول كلمة المرور هو 6 أحرف

source: password maximum length is 30 characters
ar: الحد الأقصى لطول كلمة المرور هو 30 حرفًا

source: password confirmation is required
ar: تأكيد كلمة المرور مطلوب

source: password confirmation must match with your password
ar: تأكيد كلمة المرور يجب أن يتطابق مع كلمة المرور الخاصة بك

source: Confirm Your Registeration Email
ar: تأكيد البريد الإلكتروني

source: Enter you email
ar: أدخل البريد الإلكتروني

source: Enter your password
ar: أدخل كلمة المرور

source: Confirm your password
ar: تأكيد كلمة المرور

source: <span class="text-secondary">I have read and agree terms and conditions.</span>
ar: <span class="text-secondary">لقد قرأت وأوافق على الشروط والأحكام.</span>

source: Already Have Account? <a routerLink="/login" class="link-primary">SignIn Now</a>
ar: لديك حساب؟ <a routerLink="/login" class="link-primary">دخول</a>

source: username is already exists
ar: اسم المستخدم موجود بالفعل

source: username minimum length is 6 characters
ar: اسم المستخدم يجب أن يكون طوله 6 أحرف على الأقل

source: username maximum length is 15 characters
ar: اسم المستخدم يجب أن يكون طوله 15 حرفًا كحد أقصى

source: email is required
ar: البريد الإلكتروني مطلوب

source: email is already exists
ar: البريد الإلكتروني موجود بالفعل

source: incorrect email pattern
ar: نمط البريد الإلكتروني غير صحيح

source: Accept terms is required
ar: قبول الشروط مطلوب

source: Try to connect to the internet.
ar: حاول الإتصال بالإنترنت.

source: Try To Refresh
ar: حاول مجددا

source: Refresh Now <i class="bi bi-refresh text-dark"></i>
ar: تحديث الأن<i class="bi bi-refresh text-dark"></i>
